export const HSE_CLIMATE_QUESTIONS = [
  {
    "id": 1,
    "text": "مدیریت در مسائل ایمنی , بهداشتی و زیست محیطی از رویکرد های باز پیروی می کند."
  },
  {
    "id": 2,
    "text": "از نظر من مسائل ایمنی, بهداشتی و زیست محیطی اولویت اول در حین انجام کار است."
  },
  {
    "id": 3,
    "text": "در محیط کار من پرسنل اغلب نکات ایمنی, بهداشتی و زیست محیطی رابه یکدیگر یادآوری می کنند"
  },
  {
    "id": 4,
    "text": "قوانین و دستورالعمل های ایمنی, بهداشتی و زیست محیطی به دقت رعایت می شوند."
  },
  {
    "id": 5,
    "text": "مدیریت به روشنی به اهمیت مسائل ایمنی, بهداشتی و زیست محیطی توجه دارد."
  },
  {
    "id": 6,
    "text": "من مطمئنم در بروز حوادث سازمان, محدودیت در زمان نقش اساسی را ایفا کرده است."
  },
  {
    "id": 7,
    "text": "بعضی مواقع من زمان کافی را برای انجام کار به صورت ایمن ندارم."
  },
  {
    "id": 8,
    "text": "من در آگاه سازی مدیریت در زمینه مسایل مهم ایمنی, بهداشتی و زیست محیطی مشارکت دارم."
  },
  {
    "id": 9,
    "text": "مدیریت برای رفع نگرانی ها و مشکلات ایمنی, بهداشتی و زیست محیطی با قاطعیت عمل می کند."
  },
  {
    "id": 10,
    "text": "در محیطی کار من ارتباطات خوبی در زمینه مسایل ایمنی, بهداشتی و زیست محیطی وجود دارد که من نیز در آن مشارکت دارم."
  },
  {
    "id": 11,
    "text": "من قوانین و مقررات ایمنی, بهداشتی و زیست محیطی شغلم را درک می کنم و از آنها آگاهی کامل دارم"
  },
  {
    "id": 12,
    "text": "تاکید مداوم بر موضوعات ایمنی, بهداشتی و زیست محیطی در محل کار, برای من مهم است."
  },
  {
    "id": 13,
    "text": "من در مسائل ایمنی, بهداشتی و زیست محیطی محل کارم مشارکت دارم."
  },
  {
    "id": 14,
    "text": "محل کار فعلی من نسبت به محل های کار سابقم ایمنتر و سلامت تر بوده و در آن نسبت به مسائل زیست محیطی توجه بیشتری می شود."
  },
  {
    "id": 15,
    "text": "من بشدت برای گزارش شرایط ناایمن, غیر بهداشتی و ضد زیست محیطی ترغییب و تشویق می شود."
  },
  {
    "id": 16,
    "text": "در محیط کار من مدیریت مسائل ایمنی, بهداشتی و زیست محیطی را نادیده می گیرد."
  },
  {
    "id": 17,
    "text": "برای اجرای صحیح فعالیت ها, نیازی به رعایت بعضی از قوانین و مقررات ایمنی, بهداشتی و زیست محیطی نیست."
  },
  {
    "id": 18,
    "text": "من به ندرت از آسیب دیدن در حین کار احساس نگرانی می کنم."
  },
  {
    "id": 19,
    "text": "مدیریت تنها پس از وقوع حوادث اقدام می کند."
  },
  {
    "id": 20,
    "text": "بنظر من موارد مربوط به مسائل ایمنی, بهداشتی و زیست محیطی جز الویت های اول نیست."
  },
  {
    "id": 21,
    "text": "بعضی از قوانین و مقررات ایمنی, بهداشتی و زیست محیطی در عمل قابلیت اجرا ندارد."
  },
  {
    "id": 22,
    "text": "کارکنان برای بهبود وضعیت ایمنی, بهداشتی و زمحیط زیست تشویق نمی شوند."
  },
  {
    "id": 23,
    "text": "شخصا  فکر می کنم موارد ایمنی, بهداشتی و زیست محیطی مهمتریت جنبه شغلی من نیست."
  },
  {
    "id": 24,
    "text": "در محل کار من امکان وقوع حادثه بسیار بالاست."
  },
  {
    "id": 25,
    "text": "تشویقی برای انجام کار به صورت ایمن در محیط کار صورت نمی گیرد."
  },
  {
    "id": 26,
    "text": "همیشه لازم است تا شرایط نا ایمن, غیر بهداشتی و ضد زیست محیطی به مدیریت گوشزد شود تا اقدامات اصلاحی لازم صورت گیرد."
  },
  {
    "id": 27,
    "text": "اغلب اهداف عملیاتی با اصول ایمنی, بهداشتی و زیست محیطی مغایرت دارند."
  },
  {
    "id": 28,
    "text": "سرپرستان و روسای مستقیم, مرا از موارد و مسائل موجود ایمنی , بهداشتی و زیست محیطی مطلع نمی کنند."
  },
  {
    "id": 29,
    "text": "کارکنان برای ارتقائ و بهبود وضعیت ایمنی, بهداشت و زیست محیطی تشویق نمی شوند."
  },
  {
    "id": 30,
    "text": "بعضی مواقع شرایط کاری از توانایی من برای انجام ایمن کار می کاهد."
  },
  {
    "id": 31,
    "text": "من همیشه از طریق سرپرست مستقیم خود, اطلاعات لازم ایمنی بهداشتی و زیست محیطی را کسب می کنم."
  },
  {
    "id": 32,
    "text": "با زیر پا گذاشتن یک قانون کوچک ایمنی، حس خوبی پیدا می‌کنم."
  },
  {
    "id": 33,
    "text": "در محل کار من مدیریت برای برطرف کردن مشکلات ایمنی, بهداشتی و زیست محیطی بسرعت عمل می کند."
  },
  {
    "id": 34,
    "text": "من از مسئولیت های خود در زمینه مسائل ایمنی, بهداشتی و حفظ محیط زیست آگاهی لازم را به صورت شفاف دارم."
  },
  {
    "id": 35,
    "text": "بعضی مواقع لازم است از دستورالعمل عای ایمنی بهداشتی و زیست محیطی بخاطر ملاحضات تولید منحرف شویم."
  },
  {
    "id": 36,
    "text": "کار کردن در محیط ایمن, سالم و دوستدار محیط زیست یکی از ایده آل های شخصی من است."
  },
  {
    "id": 37,
    "text": "همواره به تعداد کافی پرسنل برای انجام کار به صورت ایمن در محیط کار من وجود دارد."
  },
  {
    "id": 38,
    "text": "در محیط کار من سرپرستان و مدیران به وضوح برای ایمنی و سلامت پرسنل و حفظ محیط زیست اهمیت قایل هستند."
  },
  {
    "id": 39,
    "text": "من هرگز در ارزیابی های معمولی ایمنی بهداشتی و زیست محیطی مشارکت داده نشده ام."
  },
  {
    "id": 40,
    "text": "مدیریت نسبت به مسائل ایمنی بهداشتی و زیست محیطی به همان اندازه مسایل تولیدی توجه دارد."
  },
  {
    "id": 41,
    "text": "در محل کار من هنگام بروز حوادث, رویکرد برریس حادثه به گونه ایست که صرفا بدنبال یافتن مقصر نمی باشد."
  },
  {
    "id": 42,
    "text": "در صورتیکه دستورالعمل های ایمنی, بهداشتی و زیست محیطی رعایت نشوند مدیریت واکنش مناسبی از خود نشان می دهد."
  },
  {
    "id": 43,
    "text": "من همیشه نم توانم لوازمی که برای انجام کار به صورت ایمن نیاز دارم را در اختیار داشته باشم."
  }
];

export const HSE_CLIMATE_DIMENSIONS = [
  {
    "id": "management_commitment",
    "title": "تعهد مدیریت",
    "questions": [
      9,
      16,
      19,
      26,
      33,
      38,
      42
    ],
    "reverseQuestions": [
      16,
      19
    ]
  },
  {
    "id": "communication",
    "title": "ارتباطات",
    "questions": [
      1,
      10,
      25,
      28,
      31
    ],
    "reverseQuestions": [
      25,
      28
    ]
  },
  {
    "id": "hse_priority",
    "title": "تقدم HSE",
    "questions": [
      4,
      5,
      20,
      40
    ],
    "reverseQuestions": [
      20
    ]
  },
  {
    "id": "hse_rules",
    "title": "قوانین و مقررات HSE",
    "questions": [
      17,
      21,
      35
    ],
    "reverseQuestions": [
      17,
      21,
      35
    ]
  },
  {
    "id": "supportive_environment",
    "title": "محیط حمایتی",
    "questions": [
      3,
      15,
      22,
      29,
      32,
      41
    ],
    "reverseQuestions": [
      22,
      32
    ]
  },
  {
    "id": "hse_participation",
    "title": "مشارکت در HSE",
    "questions": [
      8,
      13,
      39
    ],
    "reverseQuestions": [
      39
    ]
  },
  {
    "id": "personnel_priority",
    "title": "اولویت های پرسنل و نیاز به HSE",
    "questions": [
      2,
      11,
      12,
      23,
      36
    ],
    "reverseQuestions": [
      23
    ]
  },
  {
    "id": "risk_perception",
    "title": "درک پرسنل از ریسک",
    "questions": [
      6,
      18,
      24,
      34
    ],
    "reverseQuestions": [
      6,
      24
    ]
  },
  {
    "id": "work_environment",
    "title": "محیط کار",
    "questions": [
      7,
      14,
      27,
      30,
      37,
      43
    ],
    "reverseQuestions": [
      7,
      27,
      30,
      43
    ]
  }
];

export const HSE_CLIMATE_OPTIONS = [
  { value: 5, label: 'کاملاً موافقم' },
  { value: 4, label: 'موافقم' },
  { value: 3, label: 'نظری ندارم' },
  { value: 2, label: 'مخالفم' },
  { value: 1, label: 'بکلی مخالفم' },
];
